In [2]:
import sqlite3
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [35]:
conn=sqlite3.connect("study.db")
c = conn.cursor()

In [36]:
c.execute("DROP TABLE IF EXISTS salesman")

In [37]:
c.execute("CREATE TABLE salesman(salesman_id n(5), name char(30), city char(35), commission decimal(7,2));")

In [39]:
c.executescript("""
INSERT INTO salesman VALUES(5001,'James Hoog', 'New York', 0.15);
INSERT INTO salesman VALUES(5002,'Nail Knite', 'Paris', 0.25);
INSERT INTO salesman VALUES(5003,'Pit Alex', 'London', 0.15);
INSERT INTO salesman VALUES(5004,'Mc Lyon', 'Paris', 0.35);
INSERT INTO salesman VALUES(5005,'Paul Adam', 'Rome', 0.45);
""")

In [41]:
#in next few queries see the effect of different use of () in WHERE statement:
pd.read_sql("""SELECT salesman_id, city from salesman 
where (name = "James Hoog" or name = "Nail Knite" ) 
and commission > 0.16;""",conn)

   salesman_id   city
0         5002  Paris

In [42]:
pd.read_sql("""SELECT salesman_id, city from salesman 
where name = "James Hoog" or name = "Nail Knite" and commission > 0.16;""",conn)

   salesman_id      city
0         5001  New York
1         5002     Paris

In [43]:
pd.read_sql("""SELECT salesman_id, city from salesman 
where (name = "James Hoog" or name = "Nail Knite" and commission > 0.16);""",conn)

   salesman_id      city
0         5001  New York
1         5002     Paris

In [44]:
pd.read_sql("""SELECT salesman_id, city from salesman 
where (name = "James Hoog") or name = "Nail Knite" and commission > 0.16;""",conn)

   salesman_id      city
0         5001  New York
1         5002     Paris